<script src="../../api/login.js"></script>
<template>
  <div class="login">
    <el-form ref="registerForm" :model="registerForm" :rules="loginRules" class="login-form" label-width="80px">
      <h3 class="title">账号注册</h3>
<!--      <el-form-item prop="nickname" label="用户昵称">
        <el-input v-model="registerForm.nickname" type="text" auto-complete="off" placeholder="用户昵称">
        </el-input>
      </el-form-item>-->
      <el-form-item prop="username" label="账号">
        <el-input v-model="registerForm.username" type="text" auto-complete="off" placeholder="账号">
        </el-input>
      </el-form-item>
      <el-form-item prop="password" label="密码">
        <el-input
          v-model="registerForm.password"
          type="password"
          auto-complete="off"
          placeholder="密码"
        >
        </el-input>
      </el-form-item>
      <el-form-item label="确认密码" prop="checkPass">
        <el-input type="password" v-model="registerForm.checkPass" autocomplete="off" placeholder="确认密码"></el-input>
      </el-form-item>
      <el-form-item prop="idcard" label="身份证">
        <el-input v-model="registerForm.idcard" type="text" auto-complete="off" placeholder="身份证">
        </el-input>
      </el-form-item>
      <el-form-item prop="name" label="真实姓名">
        <el-input v-model="registerForm.name" type="text" auto-complete="off" placeholder="真实姓名">
        </el-input>
      </el-form-item>
      <el-form-item prop="gameId" label="游戏ID">
        <el-input v-model="registerForm.gameId" type="text" auto-complete="off" placeholder="游戏昵称">
        </el-input>
      </el-form-item>
      <el-form-item prop="phone" label="手机号码">
        <el-input v-model="registerForm.phone" type="text" auto-complete="off" placeholder="手机号码">
        </el-input>
      </el-form-item>
      <el-form-item prop="yqCode" label="邀请码">
        <el-input v-model="registerForm.yqCode" type="text" auto-complete="off" placeholder="邀请码">
        </el-input>
      </el-form-item>
      <el-form-item prop="code" label="验证码">
        <el-input v-model="registerForm.code" type="text" auto-complete="off" placeholder="验证码" style="width: 62%"
        ></el-input>
        <el-button style="float: right; margin-top: 0px;width: 100px" @click="getRegCode" :disabled="codeDisable">
          {{codeLabel}}
        </el-button>
      </el-form-item>
      <el-form-item>
        <el-button
          :loading="loading"
          size="medium"
          type="primary"
          style="width: 40%"
          @click.native.prevent="handleRegister"
        >
          <span v-if="!loading">注 册</span>
          <span v-else>注 册 中...</span>
        </el-button>
        <el-button
          size="medium"
          type="primary"
          style="margin-left: 10px;width: 40%"
          @click.native.prevent="handleReset"
        ><span>重 置</span>
        </el-button>
        <div class="check">
          <el-checkbox v-model="agree">我已阅读并同意相关服务条款和隐私政策</el-checkbox>
          <span @click="open=true">查看条款</span>
        </div>
        <div style="text-align:center;margin-left:-40px;color: #fff">已有账号, <a href="/login" style="color: #ff9308">去登录</a></div>
      </el-form-item>

    </el-form>

    <el-dialog title="服务条款/隐私规则" :visible.sync="open" width="880px" append-to-body center>
      <div class="text">
        <h3>服务条款</h3><br>
        特别提示<br>
        本《用户使用协议》（以下简称“协议”）约定厦门持大创盈网络科技有限公司（以下简称“公司”）与用户（您）之间关于持大创盈电竞平台（以下简称“CD”）服务的权利义务。 公司特别提醒您在注册成为用户之前，请认真阅读本协议，确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。用户的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。<br>
        <br>
        本协议可由公司随时更新，更新后的协议条款一旦公布即代替原来的协议条款，不再另行通知。在公司修改协议条款后，如果用户不接受修改后的条款，请立即停止使用CD平台服务，用户继续使用CD平台服务将被视为接受修改后的协议。<br>
        一、账号注册<br>
        1、用户在使用本服务前需要注册一个“CD”账号。“CD”账号应当使用手机号码绑定注册，请用户使用尚未与“CD”账号绑定的手机号码，以及未被CD根据本协议封禁的手机号码注册“CD”账号。CD平台可以根据用户需求或产品需求对账号注册和绑定的方式进行更改，而无须事先通知用户。<br>
        2、鉴于“CD”账号的绑定注册方式，用户同意CD在注册时将自动提取您的手机号码及手机设备识别码等信息用于注册。<br>
        3、在用户注册及使用本服务时，CD需要搜集能识别用户身份的个人信息以便CD可以在必要时联系用户，或为用户提供更好的使用体验。CD搜集的信息包括但不限于用户的学校情况、公司情况、所属行业、城市、个性签名；CD同意对这些信息的使用将受限于第三条用户个人隐私信息保护的约束。<br>
        4、如用户为未成年人，应通过其法定监护人充分了解CD平台的服务内容以及经营方式，并向CD平台提供相应的监护人同意证明，在监护人监督下注册使用本服务。未成用户的注册行为视为其监护人同意用户接受CD平台的服务内容，同意用户进行包括但不限于提供劳务、消费、交易、赠予等活动。且监护人对用户在CD平台的一切劳务、消费、交易、赠予行为均予以确认。<br>
        二、服务内容<br>
        CD服务的具体内容将通过CD平台向用户予以实时展示。公司有权根据业务需要对其提供的服务内容予以变更。CD变更的服务内容以平台用户界面展示的为准，用户亦有可能在特别情况下收到CD关于服务变更的通知。<br>
        三、隐私政策<br>
        1、用户在注册账号或使用本服务的过程中，可能需要填写一些或提交一些必要的信息，如法律法规，规章规范性文件（以下简称“法律法规”）规定的需要填写的身份信息。如用户提交的信息不完整或不符合法律法规的规定，则用户可能无法使用本服务或在使用本服务的过程中收到的限制。<br>
        2、个人隐私信息是指涉及用户个人身份或个人隐私的信息，比如，用户真实姓名、身份证、手机号码、手机设备识别码、IP地址、用户聊天记录、会员卡号。非个人隐私信息是指用户对本服务的操作状态以及使用习惯等明确且客观反映在CD服务器端的基本记录信息、个人隐私信息范围外的其他普通信息，以及用户同意公开的上述隐私信息。<br>
        3、尊重用户个人隐私信息的私有性是公司的一贯制度，CD将采取技术措施或其他必要措施，确保用户个人隐私信息安全，防止在本服务中收集的用户个人隐私信息泄露、毁损或丢失。在发生前述情形的可能时，将及时采取补救措施。<br>
        4、公司未经用户同意不向任何第三方公开、透露用户个人隐私信息。但以下特定情形除外：<br>
        1)、根据法律法规规定或有权机关的指示提供用户的个人隐私信息；<br>
        2)、由于用户将其用户密码告知他人或与他人共享注册账号与密码，由此导致的任何个人信息的泄露，或其他非因CD原因导致的个人隐私信息的泄露；<br>
        3)、用户自行向第三方公开其个人隐私信息；<br>
        4)、用户与公司及其合作单位之间就用户个人隐私信息的使用公开达成约定，公司由此向合作单位公开用户个人隐私信息；<br>
        5)、任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息的泄露；<br>
        5、用户同意公司可在以下事项中使用用户的个人隐私信息：<br>
        1)、CD向用户及时发送重要通知，如软件更新，本协议条款的变更；<br>
        2)、公司内部进行审计、数据分析和研究等，以改进CD的产品，服务和与用户之间的沟通；<br>
        3)、基于CD产品经营需要对用户信息进行分析、审核；<br>
        4)、其他法律法规规定的事项；<br>
        6、公司重视对未成年人个人隐私信息的保护。任何18岁以下的未成年人注册账号或使用本服务应事先取得其法定监护人的书面同意。除根据本协议约定以及法律法规的规定或有权机关的指示披露外，未经监护人事先同意，CD不会向任何第三方透露未成年人的个人隐私信息。<br>
        7、用户确认，用户成功注册“CD”账号视为确认授权CD提取、公开及使用用户的地理位置信息。用户地理位置信息将作为用户公开资料之一，由CD向其他用户公开。如用户需终止向其他用户公开其地理位置信息，可随时自行设置手机隐私。<br>
        8、用户同意，基于改善CD的技术和服务，向用户提供更好的服务体验，CD或会自行收集使用或向第三方提供用户的非个人隐私信息。<br>
        9. 为了给用户提供更加个性化的服务、提升用户的使用体验，CD可能会根据用户在平台内的活动情况进行各类排名并制作排行榜。该排行榜将在平台内进行展示。排行榜的展示目的仅在于增加娱乐性、提升用户的社交体验。<br>
        四、内容规范<br>
        1、本条所述内容是指用户使用本服务过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、个性签名等注册信息及认证资料，或文字，语音，图片、图文等发送、回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。<br>
        2、用户不得利用“CD”账号或本服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容：<br>
        1)、反对宪法所确定的基本原则的；<br>
        2)、危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br>
        3)、损害国家荣誉和利益的；<br>
        4)、煽动民族仇恨、民族歧视，破坏民族团结的；<br>
        5)、破坏国家宗教政策，宣扬邪教和封建迷信的；<br>
        6)、散布谣言，扰乱社会秩序，破坏社会稳定的；<br>
        7)、散步淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br>
        8)、侮辱或者诽谤他人，侵害他人合法权益的；<br>
        9)、含有法律、行政法规禁止的其他内容的信息；<br>
        3、用户不得利用“CD”账号或本服务制作、上载、复制、发布、传播如下干扰“CD”正常运营，以及侵犯其他用户或第三方合作权益的内容：<br>
        1)、含有任何性暗示的；<br>
        2)、含有辱骂、恐吓、威胁内容的；<br>
        3)、含有骚扰、垃圾广告、恶意信息、诱骗信息的；<br>
        4)、涉及他人隐私、个人信息或资料的；<br>
        5)、侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；<br>
        6)、含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息；<br>
        五、使用规则<br>
        1、用户在本服务中或通过本服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表公司的观点、立场或政策，公司对此不承担任何责任。<br>
        2、用户不得利用“CD”账号或本服务进行如下行为：<br>
        1)、提交、发布虚假信息、或盗用他人头像或资料，冒充、利用他人名义的；<br>
        2)、强制、诱导其他用户关注、点击链接页面或分享信息的；<br>
        3)、虚构事实、隐瞒真相以误导、欺骗他人的；<br>
        4)、利用技术手段批量建立虚假账号的；<br>
        5)、利用“CD”账号或本服务从事任何犯罪活动的；<br>
        6)、制作、发布于以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；<br>
        7)、其他违法法律法规规定、侵犯其他用户合法权益、干扰“CD”正常运营或CD未明示授权的行为；<br>
        3、用户须对利用“CD”账号或本服务传送信息的真实性、合法性、无害性、准确性、有效性等全权负责，与用户所传播信息相关的任何法律责任由用户自行承担，与公司无关。如因此给公司或第三方造成损害的，用户应当依法予以赔偿。<br>
        4、用户在“CD”的内容消费行为（包括但不限于：购买平台内各类产品、服务；用户间礼物打赏、相互赠予等），均完全基于您的自主、自愿行为；内容消费行为一旦发生概不退款亦不可撤销；由用户自行对内容消费负责，公司不承担任何责任。<br>
        5、CD提供的服务中可能附带部分商业广告，用户理解并同意在使用CD平台服务的过程中平台可自主展示由公司或第三方供应商、合作伙伴提供的广告。除相关法律法规另有规定外，用户应完全自主地判断所观看的广告内容的真实性与合法性，如用户依据所展示的广告内容与第三方发生交易，应自行对该等交易负责。对用户因第三方广告内容遭受的任何损失或损害，公司不承担任何责任。<br>
        六、用户充值与收入<br>
        1、用户理解并确认，公司有权在CD平台服务中设立、添加、修改增值服务并发行增值服务代用币，如“积分”。“积分”通过使用法定货币（人民币）购买（充值）取得。“积分”只能用于购买平台积分商城商品使用权或者接受相关增值服务，不得以任何方式反向兑换法定货币，亦不能向其他方进行转让。除法律法规明确规定或本协议另有约定外，用户使用法定货币购买积分后，公司将不予退款。<br>
        2、用户理解并确认，公司有权根据经营需要自行调整、变更“积分”所能购买的CD平台积分商城物品或者相关增值服务的种类及数量，而无需另行向用户发出调整或变更的通知。<br>
        3、用户承诺，不通过CD平台公布的支付途径以外的任何第三方平台或非法途径购买“积分”。否则，造成用户购买失败或其他任何权益受损的，均由用户自行承担全部损害后果，公司将不会作出任何补偿。且如公司有理由怀疑用户的积分来源或使用方式违反本协议约定，公司将有权对用户采取相关封禁措施，包括但不限于终止该用户在CD平台使用积分的权利以及终止用户在平台的各项活动资格等。<br>
        4、积分和法定货币的兑换比例以用户购买积分时CD服务平台相关支付服务页面展示为准。公司有权根据运营情况随时变更该兑换比例，并在相关支付服务页面上展示。如用户不接受该兑换比例的，请不要使用法定货币购买钻石。<br>
        5、用户确认在购买“积分”前已经仔细核对账号及购买数量，并正确选择了相关操作选项，若用户自身输入账号错误、操作不当或不了解购买方式、兑换比例等因素造成任何形式的错误交易而损害自身权益的，公司将不会作出任何补偿或赔偿。<br>
        6、用户收入是指用户在CD平台通过公平电竞比赛取得的收入。CD为用户交易提供平台及相关技术服务，并有权就该等服务收取一定的平台服务费用。<br>
        7、用户同意CD平台按照一定的收费标准和规则对用户参与电子竞技比赛收取平台服务费。具体收费标准将由CD平台在相关收益结算界面实时公布。公司有权根据经营需要自行调整、变更收费标准，并实时公布。发生于公司调整、变更收费标准前的用户收入，按照调整、变更前的收费标准收取服务费，发生于调整、变更收费标准后的用户收入，则按照新的收费标准收取服务费。用户不接受调整、变更的收费标准的，应停止后续交易或赠予活动。用户继续交易或赠予活动的，视为接受调整、变更后的收费标准。<br>
        8、用户理解并同意，根据CD服务及用户交易内容，用户收入可能分为可提现和不可提现两类，不可提现的用户收入可依照CD平台公布的使用方式进行使用。就可提现收入，公司向用户结算前将自动扣除平台服务费，扣除平台服务费后的用户收入为用户实际取得的税前收入，用户同意按照中国税法的相关规定由公司代扣代缴税款。<br>
        9、用户理解并同意，用户对收入进行提现的具体方式及流程由CD平台根据业务需要进行自主设置，且CD平台修改相关流程设置亦无需另行通知用户。用户应依照实时的提现流程进行提现。<br>
        七、账户管理<br>
        1、“CD”账户的所有权归公司所有，用户完成申请注册手续后，获得“CD”账号的使用权，该使用权输入初始申请注册人，禁止赠与、借用、租用、转让或售卖。公司因经营需要，有权回收用户的“CD”账户。<br>
        2、用户可以更改、删除“CD”账户上的个人资料、注册信息及传送内容等。但需注意，删除有关信息的同时也会删除用户储存在系统中的文字和图片。用户需承担风险。<br>
        3、用户有责任妥善保管注册账户信息及账号密码的安全，因用户保管不善可能导致遭受盗号或密码失窃，责任由用户自行承担。用户需要对注册账号以及密码下的行为承担法律责任。用户同意在任何情况下不使用其他用户的账号或密码。在用户怀疑他人使用其账号或密码时，用户应立即通知CD平台。<br>
        4、用户应遵守本协议的各项条款，正确、适当地使用本服务，如因用户违反本协议中的任何条款，CD在通知用户后有权依据协议中断或终止对违约用户的“CD”账号提供服务。同时，CD保留在任何时候收回“CD”账号的权利。<br>
        5、用户理解并同意，如用户注册“CD”账户后【12】个月内无登陆记录，公司可以收回该账号，以免造成资源浪费，由此造成的不利后果由用户自行承担。<br>
        八、数据储存<br>
        1、除相关法律法规另有规定外，公司不对用户在本服务中相关数据的遗失负责。<br>
        2、如用户停止使用本服务或本服务因任何其他原因终止，公司有权从服务器上永久删除用户的数据。本服务停止或终止后，公司没有义务向用户提供、反馈任何数据。<br>
        九、风险承担<br>
        1、用户理解并同意，“CD”仅为用户提供信息分享、传送及获取的平台，用户必须为自己注册账号下的一切行为负责，包括用户所传送的任何内容以及由此产生的任何后果。用户应对“CD”及本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。公司无法且不会对因用户行为而导致的任何损失或损害承担责任。如果用户发现任何人违反本协议约定或以其他不当的方式使用本服务，请立即向CD举报或投诉，公司将依本协议约定进行处理。<br>
        2、用户理解并同意，因业务发展需要，CD保留单方面对本服务的全部或部分服务内容变更、暂停、终止或撤销的权利，用户需承担此风险。<br>
        十、知识产权声明<br>
        1、除本服务中涉及广告的知识产权由相应广告商享有外，CD平台在本服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权均归公司所有，但用户在使用本服务前对自己发布的内容已合法取得知识产权的除外。<br>
        2、除另有特别声明外，CD带提供本服务时所依托软件的著作权、专利权及其他知识产权均归公司所有。<br>
        3、CD在本服务中所涉及的图形、文字或其组成，以及其他CD标志及产品、服务名称（以下统称“CD标识”），其著作权或商标权归公司所有。未经公司事先书面同意，用户不得将CD标识以任何方式展示或使用或作其他处理，也不得向他人表明用户有权展示、使用、或其他有权处理CD标识的行为。<br>
        4、上述及其他任何与CD或相关广告商依法拥有的知识产权均受到法律保护，未经公司或相关广告商书面许可，用户不得以任何形式进行使用或创造相关衍生作品。<br>
        十一、法律责任<br>
        1、如果公司发现或受到他人举报或投诉用户违反本协议的约定的，公司有权不经通知随时对相关内容。包括但不限于用户资料、聊天记录进行审查、删除。并视情节轻重对违规账号处以包括但不限于警告、账号封禁、设备封禁、功能封禁、冻结账户金额的处罚。<br>
        2、用户理解并同意，公司有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此产生的一切法律责任。<br>
        3、用户理解并同意，因用户违法本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿公司与合作公司、关联公司、并使之免受损害。<br>
        十二、不可抗力及其他免责事由<br>
        1、用户理解并确认，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行动等。出现上述情况时。公司将努力在第一时间与相关单位配合，及时进行修复，但是由此给用户或第三方造成的损失，公司及合作单位在法律允许的最大范围内免责。<br>
        2、本服务同大多数互联网服务一样，受包括但不限于用户原因、网络服务质量、社会环境等因素的差异影响，可能受到各种安全问题的侵扰，如他人利用用户的资料，造成现实生活中的骚扰；用户下载安装的其它软件或访问的其他网站中含有病毒，威胁到用户的计算机信息和数据的安全，继而影响本服务的正常使用等等。用户应加强信息安全及使用者资料的保护意识，要注意加强密码保护，以免遭致损失和骚扰。<br>
        3、用户理解并确认，本服务存在因不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险，因此导致的用户或第三方任何损失，公司不承担任何责任。<br>
        4、用户理解并确认，在使用本服务过程中存在来自任何他人的包括误导性的、欺骗性的、威胁性的、诽谤性的、令人反感的或非法的信息，或侵犯他人权利的匿名或冒名的信息，以及伴随该等信息的行为，因此导致的用户或第三方的任何损失，公司不承担任何责任。<br>
        5、用户理解并确认，公司需要定期或不定期地对“CD”平台或相关的设备进行检修或者维护，如因此类情况而造成服务在合理时间内的中断，公司无需为此承担任何责任，但公司应事先进行通告。<br>
        6、公司依据法律法规、本协议约定获得处理违法违规或违约内容的权利，该权利不构成公司的义务或承诺，公司不能保证及时发现违法违规或违约行为或进行相应处理。<br>
        7、在任何情况下，公司均不对任何间接性、后果性、惩罚性、偶然性、特殊性或刑罚性的损害，包括因用户使用“CD”或本服务而遭受的利润损失，承担责任（即使公司已被告知该等损失的可能性亦然）。无论本协议中是否有其他约定，公司对用户承担的全部责任，无论因何原因或何种行为方式，始终不超过用户因使用CD提供的服务而支付给公司的费用(如有)。<br>
        十三、服务的变更、中断、终止<br>
        1、鉴于网络服务的特殊性，用户同意公司有权随时变更、中断或终止部分或全部的服务（包括收费服务）。公司变更、中断或终止的服务，应当在变更、中断或终止之前通知用户，并应向受影响的用户提供等值的替代性的服务。<br>
        2、如发生下列任何一种情形，公司有权变更、中断或终止向用户提供的免费服务或收费服务，而无需对用户或任何第三方承担任何责任：<br>
        1)、根据法律规定用户应提交真实信息，而用户提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；<br>
        2)、用户违反相关法律法规或本协议的约定；<br>
        3)、按照法律规定或有权机关的要求；<br>
        4)、出于安全的原因或其他必要的情形。<br>
        十四、其他<br>
        1、公司郑重提醒用户注意本协议中免除公司责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。如用户不同意上述条款，请不要注册并使用CD平台。未成年人应在法定监护人的陪同下阅读本协议。<br>
        2、本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律。若用户和公司之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交公司住所地有管辖权的人民法院管辖。<br>
        3、本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。<br>

        <br>
        <br>
        <h3>隐私协议</h3><br>
        CD平台隐私政策<br>
        生效日期：自颁布之日起生效<br>
        为更好落实、贯彻国家网络安全管理制度，为平台用户创建更绿色、健康的平台环境以及提供更优质、舒适的服务，厦门持大创盈网络科技有限公司（以下简称“我们”）特此制定本《CD平台隐私政策》。<br>
        我们在此特别提醒用户，在使用本软件前仔细阅读本《CD平台隐私政策》中各项条款（未成年人应在其法定监护人的陪同下阅读），并自主选择是否接受本《CD平台隐私政策》。如果您已经开始使用本软件，就表示您已经阅读、许可并接受本隐私政策中所描述的所有条款。我们有权随时变更本隐私政策，但会在产品官网公告通知。如您继续使用本软件，则视为您已经接受本隐私政策的全部更改。如您不同意变更后的隐私政策，请您不要使用本软件。<br>
        本政策将帮助您了解如下内容：<br>
        1.我们如何收集和使用个人信息<br>
        2.我们如何使用Cookie等同类技术<br>
        3.我们如何共享、转让、公开披露个人信息<br>
        4.我们如何存储个人信息<br>
        5.我们如何保护个人信息的安全<br>
        6.管理您的个人信息<br>
        7.未成年人条款<br>
        8.隐私政策的修订和通知<br>
        9.联系我们<br>
        一. 我们如何收集和使用您的个人信息<br>
        我们会按照如下方式收集您在使用服务时主动提供的，以及通过自动化手段收集您在使用功能或接受服务过程中产生的信息；<br>
        1、注册、登录<br>
        1.1 当您注册、登录CD及相关服务时，您可以通过手机号创建帐号，并且您可以完善相关的网路身份识别信息（头像、昵称），收集这些信息是为了帮助您完成注册。您还可以根据自身需求选择填写性别、生日、地区、星座、兴趣爱好及个人介绍来完善您的信息。<br>
        1.2 您也可以使用第三方帐号登录并使用CD，您将授权我们获取您在第三方平台注册的公开信息（头像、昵称以及您授权的其他信息），用于与CD帐号绑定，使您可以直接登录并使用本产品和相关服务。<br>
        1.3 基于我们与通信运营商的合作，当您使用CD“一键登录”功能时，经过您的明示同意，运营商会将您的手机号码发送给我们，便于我们为您提供快捷的登录服务。手机号码属于个人敏感信息，如果拒绝提供将无法使用“一键登录”方式注册登录CD，但不影响您通过其他方式注册登录，也不影响其他功能的正常使用。<br>
        2、浏览查看<br>
        2.1 为保证推荐内容的质量并向您推荐可能感兴趣的大神及相关信息，CD可能会收集相关必要的日志信息。<br>
        2.2 上述日志信息包括：<br>
        您操作、使用的行为信息：点击、关注、搜索、收藏、浏览、分享<br>
        您主动提供的信息：反馈、举报、发布<br>
        地理位置信息：GPS信息，WLAN接入点、蓝牙和基站等传感器信息<br>
        2.3 GPS地理位置是个人敏感信息，若您拒绝提供，我们将不会根据GPS信息向您推荐信息，且不会影响CD其他功能的正常使用。<br>
        2.4 我们会基于IP地址对应的城市、推荐您所在地区的本地相关信息。<br>
        3、大神入驻<br>
        3.1 您在申请大神入驻时，根据法律法规的要求，需要进行实名认证，以验证您的身份。在实名认证的过程中，我们和提供认证服务的第三方认证机构需要您提供真实姓名、身份证号码及清晰的身份证正反面照片。这些信息是个人敏感信息，您可以拒绝提供，且不会影响CD其他功能的正常使用。这些信息仅供实名认证及法律法规所规定的用途，未经您明示授权，不会用作其他目的。<br>
        3.2 大神入驻可能需要上传您的语音介绍和视频介绍，我们会请求您授权相机、照片、麦克风权限。您如果拒绝授权提供，将无法使用此功能，但不影响您正常使用CD的其他功能。<br>
        4、互动交流<br>
        4.1 当您关注帐号、进行浏览、关注或分享时，我们会收集您关注的帐号和前述信息，并展示关注帐号发布内容。<br>
        4.2 您可以在CD中关注好友或者被好友关注，为帮您实现这一功能，我们会创建好友列表信息。好友列表是建立与管理好友关系所必需的必要信息。<br>
        4.3 当您使用聊天室进行交流时，您需要相应的开启麦克风权限来语音交互。<br>
        5、购买服务<br>
        当您购买积分、下单，进行收益提现时，我们会收集您提供的支付宝账户信息、银行卡信息、手机信息以及身份证信息。<br>
        6、消息通知<br>
        您知悉并同意，对于您在使用产品及/或服务的过程中提供的您的联系方式（例如：联系电话），我们在运营中可能会向其他的一种或多种发送多类通知，用于用户消息告知、身份验证、安全验证、用户使用体验调研等用途；此外，我们也可能会向在前述过程中收集的手机号码通过短信、电话的方式，为您提供您可能感兴趣的服务、功能或活动等商业性信息的用途，但请您放心，如果您不愿接受这些信息，您可以通过手机短信中提供的退订方式进行退订，也可以直接与我们联系进行退订。<br>
        7、搜索<br>
        您使用CD的搜索服务时，我们会收集您的搜索关键字信息、日志记录。为了提供高效的搜索服务，部分前述信息会暂时存储在您的本地存储设备之中，并可向您展示搜索结果内容、搜索历史记录。<br>
        8、安全运行<br>
        8.1 安全保障功能<br>
        我们致力于为您提供安全、可信的产品与使用环境，提供优质而可靠的服务与信息是我们的核心目标。为实现安全保障功能所收集的信息是必要信息。<br>
        8.2 设备信息与日志信息<br>
        8.2.1 为了保障软件与服务的安全运行，我们会收集您的硬件型号、操作系统版本号、国际移动设备识别码、唯一设备标识符、网络设备硬件地址、IP地址、WLAB接入点、蓝牙、基站、软件版本号、网络接入方式、类型、状态、网络质量数据、操作、使用、服务日志。<br>
        8.2.2 为了预防恶意程序及安全运营所必需，我们会收集安装的应用信息或正在运行的进程信息、应用程序的总体运行、使用情况与频率、应用崩溃情况、总体安装使用情况、性能数据、应用来源。<br>
        8.2.3 我们可能使用您的账户信息、设备信息、服务日志信息以及我们关联方、合作方在获得您授权或依法可以共享的信息，用于判断账户安全、进行身份验证、检测及防范安全事件。<br>
        9、收集、使用个人信息目的变更<br>
        请您了解，随着我们业务的发展，可能会对CD的功能和提供的服务有所调整变化。原则上，当新功能或服务与我们当前提供的功能或服务相关时，收集与使用的个人信息将与原处理目的具有直接或合理关联。在与原处理目的无直接或合理关联的场景下，我们收集、使用您的个人信息，会再次进行告知，并征得您的同意。<br>
        10、依法豁免征得同意收集和使用的个人信息<br>
        您充分理解并同意，我们在以下情况下收集、使用您的个人信息无需您的授权同意，且我们可能不会同意您提出的更正/修改、删除、注销、撤回同意、索取信息的请求：<br>
        1、与国家安全、国防安全有关的；<br>
        2、与公共安全、公共卫生、重大公共利益有关的；<br>
        3、与犯罪侦查、起诉、审判和判决执行等有关的；<br>
        4、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；<br>
        5、所收集的个人信息是您自行向社会公众公开的；<br>
        6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；<br>
        7、根据您的要求签订合同所必需的；<br>
        8、用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；<br>
        9、为合法的新闻报道所必需的；<br>
        10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；<br>
        11、法律法规规定的其他情形。<br>
        请知悉，根据适用的法律，若我们对个人信息采取技术措施和其他必要措施进行处理，使得数据接收方无法重新识别特定个人且不能复原，或我们可能会对收集的信息进行去标识化地研究、统计分析和预测，用于改善CD的内容和布局，为商业决策提供产品或服务支撑，以及改进我们的产品和服务（包括使用匿名数据进行机器学习或模型算法训练），则此类处理后数据的使用无需另行向您通知并征得您的同意。<br>
        如我们停止运营CD产品或服务，我们将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，对所持有的个人信息进行删除或匿名化处理。<br>
        二、我们如何使用Cookie等同类技术<br>
        Cookie和设备信息标识等同类技术是互联网中普遍使用的技术。当您使用CD及相关服务时，我们可能会使用相关技术向您的设备发送一个或多个Cookie或匿名标识符，以收集、标识您访问、使用本产品时的信息。我们承诺，不会将Cookie用于本隐私政策所述目的之外的任何其他用途。我们使用Cookie和同类技术主要为了实现以下功能或服务：<br>
        1、保障产品与服务的安全、高效运转<br>
        我们可能会设置认证与保障安全性的Cookie或匿名标识符，使我们确认您是否安全登录服务，或者是否遇到盗用、欺诈及其他不法行为。这些技术还会帮助我们改进服务效率，提升登录和响应速度。<br>
        2、帮助您获得更轻松的访问体验<br>
        使用此类技术可以帮助您省去重复您填写个人信息、输入搜索内容的步骤和流程（示例：记录搜索、表单填写）。<br>
        3、为您推荐、展示、推送您可能感兴趣的内容或帐号<br>
        3.1 我们可能会利用此类技术了解您的偏好和使用习惯，进行数据分析，以改善产品服务、推荐用户感兴趣的信息或功能。<br>
        3.2 在CD的分享页中，我们可能会对使用Cookie对浏览活动进行记录，用于向您推荐信息和排查崩溃、延迟的相关异常情况以及探索更好的服务方式。<br>
        4、Cookie的清除<br>
        大多数浏览器均为用户提供了清除浏览器缓存数据的功能，您可以在浏览器设置功能中进行相应的数据清除操作。如您进行清除，您可能无法使用由我们提供的、依赖于Cookie的服务或相应功能。<br>
        三、我们如何共享、转让、公开披露个人信息<br>
        1、共享<br>
        1.1 共享原则<br>
        1.1.1 授权同意原则：未经您的同意，我们不会共享您的个人信息，除非共享的个人信息是去标识化处理后的信息，且共享第三方无法重新识别此类信息的自然人主题。如果第三方使用信息的目的超越原授权同意范围，他们需要重新征得您的同意。<br>
        1.1.2 合法正当与最小必要原则：共享的数据必须具有合法正当目的，且共享的数据以达成目的必要为限。<br>
        1.1.3 安全审慎原则：我们将审慎评估第三方使用共享信息的目的，对这些合作方的安全保障能力进行综合评估，并要求其遵循合作法律协议。我们会对合作方获取信息的软件工具开发包（SDK）、应用程序接口（API）进行严格的安全检测，以保护数据安全。<br>
        1.2 实现功能或服务的共享信息<br>
        1.2.1 当您在使用CD中由我们的关联方、第三方提供的功能，或者当软件服务提供商、智能设备提供商、系统服务提供商与我们联合为您提供服务时我们会将实现业务所必需的信息与这些关联方、第三方共享，用于综合统计并通过算法做特征与偏好分析，形成间接人群画像，用以向您进行推荐、展示或推送您可能感兴趣的信息，或者推送更适合您的特定功能、服务或商业广告。<br>
        1.2.2 支付功能：支付功能由与我们合作的第三方支付机构向您提供服务。第三方支付机构可能需要收集您的姓名、手机号及验证码、支付宝账号或者银行卡账号，上述信息是个人敏感信息，这些信息是支付功能所必需的信息，拒绝提供将导致您无法使用该功能，但不影响其他功能的正常使用。<br>
        1.2.3 订单功能：当您使用CD订单功能时，经过您的授权，我们可能会与下单的相关服务提供方共享您的订单信息以方便您统一查询订单信息。<br>
        1.2.4 为与您使用的终端机型适配消息推送功能，我们可能会通过SDK等技术与终端设备制造商（华为、小米、OPPO、VIVO等）共享手机型号、版本及相关设备信息。<br>
        1.3 实现安全与分析统计的共享信息<br>
        1.3.1 保障使用安全：我们非常重视帐号、服务及内容安全，为保障您和其他用户的帐号与财产安全，使您和我们的正当合法权益免受不法侵害，我们和关联方或服务提供商可能会共享必要的设备、帐号及日志信息。<br>
        1.3.2 分析产品使用情况：为分析我们服务的使用情况，提升用户使用的体验，我们可能会与关联方或第三方共享产品使用情况（崩溃、闪退）的统计性数据，这些数据难以与其他信息结合识别您的个人身份。<br>
        2、转让<br>
        2.1 我们不会转让您的个人信息给任何其他第三方，除非征得您的明确同意。<br>
        2.2 随着我们业务的持续发展，我们将有可能进行合并、收购、资产转让，您的个人信息有可能因此而被转移。在发生前述变更时，我们将按照法律法规及不低于本隐私政策所载明的安全标准要求继受方保护您的个人信息，否则我们将要求继受方重新征得您的授权同意。<br>
        3、公开披露<br>
        我们仅在下列情形下，公开披露您的个人隐私信息：<br>
        1.征得您明确的授权同意；<br>
        2.基于国家法律法规的规定而对外披露；<br>
        3.应国家司法机关及其他有关机关基于法定程序的要求而披露；<br>
        4.为保护您的合法权益不受损而披露；<br>
        5.在紧急情况下，为保护其他用户及第三方人身安全而披露；<br>
        6.应用户监护人合法要求而提供用户个人身份信息时；<br>
        7.任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息泄露的。<br>
        四、我们如何存储个人信息<br>
        1、存储地点<br>
        我们依照法律法规的规定，将在境内运营过程中收集和产生的您的个人信息存储于中华人民共和国境内。目前，我们不会将上述信息传输至境外，如果我们向境外传输，我们将会遵循相关国家规定或者征求您的同意。<br>
        2、存储期限<br>
        我们仅在为提供CD及服务之目的所必需的期限内保留您的个人信息：您发布的信息，在您未撤回、删除或者未注销帐号期间，我们会保留相关信息。超出必要期限后，我们将对您的个人信息进行删除或匿名化处理，但法律法规另有规定的除外。<br>
        五、我们如何保护个人信息的安全<br>
        1、我们非常重视您个人信息的安全，将努力采取合理的安全措施（包括技术方面和管理方面）来保护您的个人信息，防止您提供的个人信息被不当使用或在未授权的情况下被访问、公开披露、使用、修改、损坏、丢失或泄露。<br>
        2、我们将使用不低于行业同行的加密技术、匿名化处理等合理可行的手段保护您的个人信息，并使用安全保护机制防止您的个人信息遭到恶意攻击。<br>
        3、我们会建立专门的安全部门、安全管理制度、数据安全流程保障您的个人信息安全。我们采取严格的数据使用和访问制度，确保只有授权人员才可访问您的个人信息，并适时对数据和技术进行安全审计，保障您的个人信息安全。<br>
        4、尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即使竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全，我们将尽力确保您提供给我们的个人信息的安全性。<br>
        5、您知悉并理解，您接入我们的服务所使用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。因此，我们强烈建议您采取积极措施保护个人信息的安全，包括但不限于使用复杂密码、定期修改密码、不将自己的帐号密码及相关个人信息透露给他人等。<br>
        6、我们制定了严密的应急处理方案，以确保在突发状况下能够将损失减小到最低。一旦发生用户信息安全事件（泄露、丢失等）后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已经采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以推送通知、邮件、信函、短信等形式告知您，难以逐一告知时，我们会采取合理、有效的方式发布公告。同时，我们还将按照相关监管部门要求，上报用户信息安全事件的处置情况。<br>
        7、您一旦离开CD及相关服务，浏览或使用其他网站、服务及内容资源，我们将没有能力和直接义务保护您在CD及相关服务之外的软件、网站提交的任何个人信息，无论您登录、浏览或使用上述软件、网站是否基于CD的链接或引导。<br>
        六、管理您的个人信息<br>
        我们将按照中国相关的法律、法规、标准，以及其他国家、地区的成文法、习惯法，保障您对自己的个人信息行使如下权利：<br>
        1、访问个人帐号信息<br>
        您可以查询、访问您的头像、用户名、性别、生日、地区、个人签名，您可以在【我的】-【个人资料】进行查询、访问、更正。<br>
        2、删除您的信息<br>
        在以下情形中，您可以向我们提出删除个人信息的请求：<br>
        2.1 如果我们处理个人信息的行为违反法律法规；<br>
        2.2 如果我们收集、使用您的个人信息，却未征得您的明确同意；<br>
        2.3 如果我们处理个人信息的行为严重违反了该政策；<br>
        2.4 如果您主动注销了帐号。<br>
        当我们协助您删除相关信息后，因为适用的法律和安全技术，我们可能无法立即从备份系统中删除相应的信息，我们将安全地存储您的个人信息并将其与任何进一步处理隔离，直到备份可以清除或实现匿名。<br>
        3、改变您授权同意的范围<br>
        部分功能可能需要您的一些个人信息才能完成，当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。<br>
        4、注销帐号<br>
        您可以在【在线客服】进行帐号注销。在您注销帐号前，我们将验证您的个人身份、安全状态、设备信息等。有关注销的流程和内容，可以在注销功能中进行查看。您知悉并理解，注销帐号的行为是不可逆的行为，当您注销帐号后，我们将删除有关您的相关信息或进行匿名化处理，但法律法规另有规定的除外。<br>
        5、投诉举报<br>
        您可以按照我们公示的制度进行投诉或举报。如果您认为您的个人信息权利可能受到侵害，或者发现侵害个人信息权利的线索，您可以通过【在线客服】进行反馈，我们会实时跟进您的反馈。<br>
        6、访问隐私政策<br>
        您可以在注册页面，或者在登录个人帐号【个人中心】-【隐私政策】查看本隐私政策的全部内容。<br>
        7、停止运营向您告知<br>
        如我们停止运营，我们将即时停止收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，并对所持有的您的个人信息进行删除或匿名化处理。<br>
        七、未成年人条款<br>
        我们重视对未成年人个人隐私信息的保护。我们将依赖用户提供的个人信息判断用户是否为未成年人。任何18周岁以下的未成年人注册账号或使用本服务应事先取得家长或其法定监护人（以下简称“监护人”）的书面同意。<br>
        我们将根据国家相关法律法规的规定保护未成年人的相关信息。若您是未成年人的监护人，当您对您所监护的未成年人的个人信息有相关疑问时，请通过“如何联系我们”章节中的联系方式与我们联系。如果我们发现在未事先获得可证实的监护人同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。<br>
        除根据法律法规的规定及有权机关的指示披露外，我们不会使用向任何第三方透露未成年人的聊天记录及其他个人隐私信息。除本协议约定的例外情形外，未经监护人事先同意，我们不会使用或向任何第三方透露未成年人的个人隐私信息。<br>
        【在线客服】中可以设置青少年模式，功能开启后只能在特定时长内使用CD，超过特定时长时，需要您输入提前设置的密码才可以继续使用。<br>
        八、隐私政策的修订和通知<br>
        为保证您能够获得更好的服务并应平台业务调整以及未来发展，本政策也会与时俱进随之更新。但在更新的同时，我们会以单独、明显的方式获取您的授权，否则我们将维持本政策所赋予您的权利。<br>
        我们在应用程序、官方网站更新版本后或官方发出公告后以合理、适当、明显的方式提醒您相关内容的更新，以便您能更快了解您权利的更迭。<br>
        对于重大变更，我们还会提供更为显著的通知方式（我们会通过包括但不限于邮件、短信、公告、首页或在浏览页面做特别提示等方式，来向您表达政策的更新内容）。<br>
        本政策所指的重大变更包括但不限于：<br>
        1.我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；<br>
        2.我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；<br>
        3.个人信息共享、转让或公开披露的主要对象发生变化；<br>
        4.您参与个人信息处理方面的权利及其行使方式发生重大变化；<br>
        5.我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；<br>
        6.个人信息安全影响评估报告表明存在高风险时。<br>
        我们还将对本隐私权政策的旧版本予以存档，供您查阅。<br>
        九、联系我们<br>
        如果您对本政策存有任何疑问、意见或建议，可以通过如下方式与我们联系。<br>
        电子邮件：<br>
        联系CD在线客服：【在线客服】进行咨询<br>
        我们将在7天内予以您答复<br>

      </div>
    </el-dialog>
  </div>
</template>

<script>
import { getRegCode, register } from '@/api/register'

export default {
  name: 'Login',
  data() {
    var validatePass2 = (rule, value, callback) => {
      if (value === '') {
        callback(new Error('请再次输入密码'))
      } else if (value !== this.registerForm.password) {
        callback(new Error('两次输入密码不一致'))
      } else {
        callback()
      }
    }
    return {
      codeUrl: '',
      cookiePassword: '',
      registerForm: {
        // nickname: '',
        username: '',
        password: '',
        checkPass: '',
        idcard: '',
        name: '',
        gameId: '',
        phone: '',
        yqCode: '',
        code: '',
        uuid: ''
      },
      loginRules: {
        nickname: [
          { required: true, trigger: 'blur', message: '用户昵称不能为空' }
        ],
        username: [
          { required: true, trigger: 'blur', message: '用户名不能为空' }
        ],
        password: [
          { required: true, trigger: 'blur', message: '密码不能为空' },
          { min: 8, message: '密码长度不能少于8个字符', trigger: 'blur' }
        ],
        checkPass: [
          { required: true, trigger: 'blur', message: '确认密码不能为空' },
          { validator: validatePass2, trigger: 'blur' }
        ],
        idcard: [
          { required: true, trigger: 'blur', message: '身份证不能为空' }
        ],
        name: [
          { required: true, trigger: 'blur', message: '真实姓名不能为空' }
        ],
        gameId: [
          { required: true, trigger: 'blur', message: '游戏ID不能为空' }
        ],
        phone: [
          { required: true, trigger: 'blur', message: '手机号码不能为空' },
          {
            pattern: /^1[3|4|5|6|7|8|9][0-9]\d{8}$/,
            message: '请输入正确的手机号码',
            trigger: 'blur'
          }
        ],
        code: [
          { required: true, trigger: 'blur', message: '验证码不能为空' }
        ]

      },
      loading: false,
      codeDisable: false,
      codeLabel: '获取验证码',
      timer: null,
      agree: false,
      open: false
    }
  },
  watch: {},
  created() {
  },
  methods: {
    handleRegister() {
      this.$refs.registerForm.validate(valid => {
        if (valid) {
          if (!this.agree) {
            this.msgError('请阅读并勾选服务条款和隐私协议')
            return
          }
          this.loading = true
          const form = this.registerForm
          delete form.checkPass
          register(form).then(() => {
            this.msgSuccess('注册成功')
            this.$router.push({ path: '/login' }).catch(() => {
            })
          }).catch(() => {
            this.$set(this.registerForm, 'checkPass', '')
            this.loading = false
          })
        }
      })
    },
    countdown() {
      if (this.codeDisable) {
        return
      }
      this.codeDisable = true
      let n = 60
      this.codeLabel = '剩余 ' + n + 's'
      const run = setInterval(() => {
        n = n - 1
        if (n < 0) {
          clearInterval(run)
        }
        this.codeLabel = '剩余 ' + n + 's'
        if (this.codeLabel < '剩余 ' + 0 + 's') {
          this.codeDisable = false
          this.codeLabel = '重新获取'
        }
      }, 1000)
    },
    handleReset() {
      this.registerForm = {
        // nickname: '',
        username: '',
        password: '',
        checkPass: '',
        idcard: '',
        name: '',
        gameId: '',
        phone: '',
        yqCode: '',
        code: '',
        uuid: ''
      }
      this.resetForm('registerForm')
    },
    getRegCode() {
      this.$refs['registerForm'].validateField('phone', valid => {
        if (valid === '') {
          const param = {
            phone: this.registerForm.phone
          }
          getRegCode(param).then(res => {
            this.registerForm.uuid = res.msg
            this.countdown()
          }).catch(err => {
          })
        }

      })

    }
  }
}
</script>

<style lang="scss" scoped>
.login {
  display: flex;
  justify-content: center;
  align-items: center;
  height: 100%;
  overflow-x: auto;
  background: #ffffff url(../../assets/images/login-bg.jpg) no-repeat;
  background-size: 118% 100%;
}

.title {
  margin: 0px auto 15px auto;
  text-align: left;
  color: #ff9308;
}

.login-form {
  border-radius: 6px;
  background: rgba(45, 45, 44, 0.8);
  width: 460px;
  padding: 20px 40px 5px 40px;
  border: 1px solid rgba(45, 45, 44, 0.5);
  .el-input {
    height: 36px;

    input {
      height: 38px;
    }
  }
  .el-form-item {
    margin-bottom: 18px;
  }
  .input-icon {
    height: 39px;
    width: 14px;
    margin-left: 2px;
  }
}

.login-img {
  width: 400px;
  margin-right: 20px;
}

.forget {
  display: inline-block;
  float: right;
  font-size: 14px;
  color: #b3b3b3;
}
::v-deep .el-form-item__label{
  color: #fff !important;
}
::v-deep .el-form-item__error {
  color: #ff9308;
}

::v-deep .el-checkbox__label {
  color: #fff;
  font-size: 12px;
}

::v-deep .el-checkbox__input.is-checked .el-checkbox__inner, .el-checkbox__input.is-indeterminate .el-checkbox__inner {
  background-color: #fd9208;
  border-color: #fd9208;
}

::v-deep .el-checkbox__input.is-checked + .el-checkbox__label {
  color: #fff;
}

::v-deep .el-checkbox.is-bordered.is-checked {
  border-color: #fd9208;
}

::v-deep .el-checkbox__input.is-focus .el-checkbox__inner {
  border-color: #fd9208;
}

.check{
  font-size: 12px;
  span{
    color: #fd9208;
    margin-left: 10px ;
    display: inline-block;
    text-decoration: underline;
    cursor: pointer;
  }
}
</style>
